# Ultralytics YOLO11-CBACA object detection model
# Based on YOLO11 architecture + CA + CARAFE + CBAM

# Parameters
nc: 80  # number of classes，柑橘資料集可改成 5

scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO11 backbone
backbone:
  # [from, repeats, module, args]
  [
    [-1, 1, Conv, [64, 3, 2]],          # 0-P1/2
    [-1, 1, Conv, [128, 3, 2]],         # 1-P2/4
    [-1, 2, C3k2, [256, False, 0.25]],  # 2

    [-1, 1, Conv, [256, 3, 2]],         # 3-P3/8
    [-1, 2, C3k2, [512, False, 0.25]],  # 4  P3 feature

    [-1, 1, Conv, [512, 3, 2]],         # 5-P4/16
    [-1, 2, C3k2, [512, True]],         # 6  P4 feature

    [-1, 1, Conv, [1024, 3, 2]],        # 7-P5/32

    # ① CA：把 YOLO11 Backbone 最後一個 C3k2 改成 C3k2_CA
    [-1, 2, C3k2_CA, [1024, True]],     # 8  C3k2 + Coordinate Attention

    [-1, 1, SPPF, [1024, 5]],           # 9
    [-1, 2, C2PSA, [1024]],             # 10
  ]

# YOLO11 neck + head
head:
  [
    # ② CARAFE：取代原本第一個 Upsample
    # 原本 YOLO11 是：[-1, 1, nn.Upsample, [None, 2, "nearest"]]
    [-1, 1, CARAFE, [1024, 3, 2]],      # 11  P5 upsample: 20x20 -> 40x40
    [[-1, 6], 1, Concat, [1]],          # 12  cat backbone P4
    [-1, 2, C3k2, [512, False]],        # 13  P4 neck feature

    # ② CARAFE：取代原本第二個 Upsample
    [-1, 1, CARAFE, [512, 3, 2]],       # 14  P4 upsample: 40x40 -> 80x80
    [[-1, 4], 1, Concat, [1]],          # 15  cat backbone P3
    [-1, 2, C3k2, [256, False]],        # 16  P3/8-small feature

    [-1, 1, Conv, [256, 3, 2]],         # 17  downsample P3 -> P4
    [[-1, 13], 1, Concat, [1]],         # 18  cat head P4
    [-1, 2, C3k2, [512, False]],        # 19  P4/16-medium feature

    [-1, 1, Conv, [512, 3, 2]],         # 20  downsample P4 -> P5
    [[-1, 10], 1, Concat, [1]],         # 21  cat backbone P5 / C2PSA output
    [-1, 2, C3k2, [1024, True]],        # 22  P5/32-large feature

    # ③ CBAM ×3：三個尺度進 Detect 前各加一個 CBAM
    [16, 1, CBAM, []],                  # 23  CBAM for P3-small
    [19, 1, CBAM, []],                  # 24  CBAM for P4-medium
    [22, 1, CBAM, []],                  # 25  CBAM for P5-large

    # Detect 使用 CBAM 後的三個輸出
    [[23, 24, 25], 1, Detect, [nc]],    # 26  Detect(P3, P4, P5)
  ]